# Bria Stalker
## WK14 4/22/2021
### Python Pandas DataFrame-Grouping and Mapping

In [1]:
import numpy as np

from pandas import Series,DataFrame
import pandas as pd

In [3]:
df = DataFrame({'City':['Alma','Brian head','Fox Park','Lake Mary'],'Altitude':[10355,9800,9062,8966]})
df

         City  Altitude
0        Alma     10355
1  Brian head      9800
2    Fox Park      9062
3   Lake Mary      8966

In [5]:
st_map={'Alma':'Colorado','Brian Head': 'Utah','Fox Park':'Wyoming','Lake Mary':'Cali'}
st_map

{'Alma': 'Colorado',
 'Brian Head': 'Utah',
 'Fox Park': 'Wyoming',
 'Lake Mary': 'Cali'}

In [8]:
df['State']=df['City'].map(st_map)
df

         City  Altitude     state     State
0        Alma     10355  Colorado  Colorado
1  Brian head      9800       NaN       NaN
2    Fox Park      9062   Wyoming   Wyoming
3   Lake Mary      8966      Cali      Cali

In [9]:
df = DataFrame({'City':['Alma','Brian head','Fox Park','Lake Mary'],'Altitude':[10355,9800,9062,8966]})
df

         City  Altitude
0        Alma     10355
1  Brian head      9800
2    Fox Park      9062
3   Lake Mary      8966

In [12]:
st_map={'Alma':'Colorado','Brian head': 'Utah','Fox Park':'Wyoming','Lake Mary':'California'}
st_map

{'Alma': 'Colorado',
 'Brian head': 'Utah',
 'Fox Park': 'Wyoming',
 'Lake Mary': 'California'}

In [13]:
df['State'] = df['City'].map(st_map) #add column to data
df

         City  Altitude       State
0        Alma     10355    Colorado
1  Brian head      9800        Utah
2    Fox Park      9062     Wyoming
3   Lake Mary      8966  California

In [14]:
#apply fucntion
def meter(x):
    return x/3.2808

In [17]:
df['Altitude']=df['Altitude'].apply(meter) #update altitude to meters...use .apply then call function by name after specifying columns
df

         City     Altitude       State
0        Alma  3156.242380    Colorado
1  Brian head  2987.076323        Utah
2    Fox Park  2762.131188     Wyoming
3   Lake Mary  2732.870032  California

In [18]:
df = DataFrame(np.random.randn(4,3), columns=list('bde'), index = ['UT','OH','TX','OR'])

In [19]:
df

           b         d         e
UT -1.785121 -0.096059  0.313985
OH  0.191535 -1.091549 -1.994068
TX  0.538550 -0.284889  0.320753
OR  0.515572 -0.591631 -0.919109

In [20]:
def dif(x):
    return x.max() - x.min()

In [21]:
df.apply(dif) #sending whole df...returns diff between max and min in each columns

b    2.323672
d    0.995490
e    2.314821
dtype: float64

In [22]:
df.apply(dif, axis = 1) #gives diff between max and min by row

UT    2.099106
OH    2.185604
TX    0.823439
OR    1.434681
dtype: float64

In [24]:
df.apply(pd.value_counts).fillna(0) #gives count for each value that occurs per column

             b    d    e
-1.994068  0.0  0.0  1.0
-1.785121  1.0  0.0  0.0
-1.091549  0.0  1.0  0.0
-0.919109  0.0  0.0  1.0
-0.591631  0.0  1.0  0.0
-0.284889  0.0  1.0  0.0
-0.096059  0.0  1.0  0.0
 0.191535  1.0  0.0  0.0
 0.313985  0.0  0.0  1.0
 0.320753  0.0  0.0  1.0
 0.515572  1.0  0.0  0.0
 0.538550  1.0  0.0  0.0

In [27]:
#groupby
df = DataFrame({'k1':['a','a','b','b','c'], 
                'k2':['one','two','one','two','one'],
                'dataset1': np.random.randn(5),
                'dataset2': np.random.randn(5)})
df

  k1   k2  dataset1  dataset2
0  a  one  0.077772  1.138108
1  a  two  1.047211  0.495029
2  b  one  0.118087 -1.184927
3  b  two -0.063077 -1.668289
4  c  one  0.218114  1.057273

In [30]:
df.groupby('k1').count()

    k2  dataset1  dataset2
k1
a    2         2         2
b    2         2         2
c    1         1         1

In [31]:
df.groupby('k1').size()

k1
a    2
b    2
c    1
dtype: int64

In [33]:
df.groupby(['k1','k2']).count()

        dataset1  dataset2
k1 k2
a  one         1         1
   two         1         1
b  one         1         1
   two         1         1
c  one         1         1

In [34]:
df

  k1   k2  dataset1  dataset2
0  a  one  0.077772  1.138108
1  a  two  1.047211  0.495029
2  b  one  0.118087 -1.184927
3  b  two -0.063077 -1.668289
4  c  one  0.218114  1.057273

In [37]:
df['dataset1'].groupby(df['k1']).mean() #find means of values grouped by a,b,c
#gives mean between two values with a as k1, then b as k1, and c as k1

k1
a    0.562491
b    0.027505
c    0.218114
Name: dataset1, dtype: float64

In [38]:
df.groupby('k1').mean()

    dataset1  dataset2
k1
a   0.562491  0.816569
b   0.027505 -1.426608
c   0.218114  1.057273

In [39]:
df.groupby(['k1','k2']).mean() #mean of both datasets

        dataset1  dataset2
k1 k2
a  one  0.077772  1.138108
   two  1.047211  0.495029
b  one  0.118087 -1.184927
   two -0.063077 -1.668289
c  one  0.218114  1.057273

In [42]:
group = df.groupby(['k1','k2'])[['dataset1']] #just mean of dataset 1

group.mean()

        dataset1
k1 k2
a  one  0.077772
   two  1.047211
b  one  0.118087
   two -0.063077
c  one  0.218114